Revit 2027 API
BuiltInFailures.RoomFailures.RoomNotEnclosed Property
 [Room] is not in a properly enclosed region
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RoomNotEnclosed { get; }
Public Shared ReadOnly Property RoomNotEnclosed As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RoomNotEnclosed {
	FailureDefinitionId^ get ();
}
static member RoomNotEnclosed : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RoomFailures Class
Autodesk.Revit.DB Namespace